Build encoder done..
Build decoder done..
('model.output_shape: ', (None, 375000, 12), '\n')
model.summary()
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
input_1 (InputLayer)         (None, 500, 750, 3)       0
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 500, 750, 64)      1792
_________________________________________________________________
batch_normalization_1 (Batch (None, 500, 750, 64)      256
_________________________________________________________________
activation_1 (Activation)    (None, 500, 750, 64)      0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 500, 750, 64)      36928
_________________________________________________________________
batch_normalization_2 (Batch (None, 500, 750, 64)      256
_________________________________________________________________
activation_2 (Activation)    (None, 500, 750, 64)      0
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 250, 375, 64)      0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 250, 375, 128)     73856
_________________________________________________________________
batch_normalization_3 (Batch (None, 250, 375, 128)     512
_________________________________________________________________
activation_3 (Activation)    (None, 250, 375, 128)     0
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 250, 375, 128)     147584
_________________________________________________________________
batch_normalization_4 (Batch (None, 250, 375, 128)     512
_________________________________________________________________
activation_4 (Activation)    (None, 250, 375, 128)     0
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 125, 187, 128)     0
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 125, 187, 256)     295168
_________________________________________________________________
batch_normalization_5 (Batch (None, 125, 187, 256)     1024
_________________________________________________________________
activation_5 (Activation)    (None, 125, 187, 256)     0
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 125, 187, 256)     590080
_________________________________________________________________
batch_normalization_6 (Batch (None, 125, 187, 256)     1024
_________________________________________________________________
activation_6 (Activation)    (None, 125, 187, 256)     0
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 125, 187, 256)     590080
_________________________________________________________________
batch_normalization_7 (Batch (None, 125, 187, 256)     1024
_________________________________________________________________
activation_7 (Activation)    (None, 125, 187, 256)     0
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 62, 93, 256)       0
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 62, 93, 512)       1180160
_________________________________________________________________
batch_normalization_8 (Batch (None, 62, 93, 512)       2048
_________________________________________________________________
activation_8 (Activation)    (None, 62, 93, 512)       0
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 62, 93, 512)       2359808
_________________________________________________________________
batch_normalization_9 (Batch (None, 62, 93, 512)       2048
_________________________________________________________________
activation_9 (Activation)    (None, 62, 93, 512)       0
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 62, 93, 512)       2359808
_________________________________________________________________
batch_normalization_10 (Batc (None, 62, 93, 512)       2048
_________________________________________________________________
activation_10 (Activation)   (None, 62, 93, 512)       0
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 31, 46, 512)       0
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 31, 46, 512)       2359808
_________________________________________________________________
batch_normalization_11 (Batc (None, 31, 46, 512)       2048
_________________________________________________________________
activation_11 (Activation)   (None, 31, 46, 512)       0
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 31, 46, 512)       2359808
_________________________________________________________________
batch_normalization_12 (Batc (None, 31, 46, 512)       2048
_________________________________________________________________
activation_12 (Activation)   (None, 31, 46, 512)       0
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 31, 46, 512)       2359808
_________________________________________________________________
batch_normalization_13 (Batc (None, 31, 46, 512)       2048
_________________________________________________________________
activation_13 (Activation)   (None, 31, 46, 512)       0
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 15, 23, 512)       0
_________________________________________________________________
up_sampling2d_1 (UpSampling2 (None, 30, 46, 512)       0
_________________________________________________________________
zero_padding2d_1 (ZeroPaddin (None, 31, 46, 512)       0
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 31, 46, 512)       2359808
_________________________________________________________________
batch_normalization_14 (Batc (None, 31, 46, 512)       2048
_________________________________________________________________
activation_14 (Activation)   (None, 31, 46, 512)       0
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 31, 46, 512)       2359808
_________________________________________________________________
batch_normalization_15 (Batc (None, 31, 46, 512)       2048
_________________________________________________________________
activation_15 (Activation)   (None, 31, 46, 512)       0
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 31, 46, 512)       2359808
_________________________________________________________________
batch_normalization_16 (Batc (None, 31, 46, 512)       2048
_________________________________________________________________
activation_16 (Activation)   (None, 31, 46, 512)       0
_________________________________________________________________
up_sampling2d_2 (UpSampling2 (None, 62, 92, 512)       0
_________________________________________________________________
zero_padding2d_2 (ZeroPaddin (None, 62, 93, 512)       0
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 62, 93, 512)       2359808
_________________________________________________________________
batch_normalization_17 (Batc (None, 62, 93, 512)       2048
_________________________________________________________________
activation_17 (Activation)   (None, 62, 93, 512)       0
_________________________________________________________________
conv2d_18 (Conv2D)           (None, 62, 93, 512)       2359808
_________________________________________________________________
batch_normalization_18 (Batc (None, 62, 93, 512)       2048
_________________________________________________________________
activation_18 (Activation)   (None, 62, 93, 512)       0
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 62, 93, 256)       1179904
_________________________________________________________________
batch_normalization_19 (Batc (None, 62, 93, 256)       1024
_________________________________________________________________
activation_19 (Activation)   (None, 62, 93, 256)       0
_________________________________________________________________
up_sampling2d_3 (UpSampling2 (None, 124, 186, 256)     0
_________________________________________________________________
zero_padding2d_3 (ZeroPaddin (None, 125, 187, 256)     0
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 125, 187, 256)     590080
_________________________________________________________________
batch_normalization_20 (Batc (None, 125, 187, 256)     1024
_________________________________________________________________
activation_20 (Activation)   (None, 125, 187, 256)     0
_________________________________________________________________
conv2d_21 (Conv2D)           (None, 125, 187, 256)     590080
_________________________________________________________________
batch_normalization_21 (Batc (None, 125, 187, 256)     1024
_________________________________________________________________
activation_21 (Activation)   (None, 125, 187, 256)     0
_________________________________________________________________
conv2d_22 (Conv2D)           (None, 125, 187, 128)     295040
_________________________________________________________________
batch_normalization_22 (Batc (None, 125, 187, 128)     512
_________________________________________________________________
activation_22 (Activation)   (None, 125, 187, 128)     0
_________________________________________________________________
up_sampling2d_4 (UpSampling2 (None, 250, 374, 128)     0
_________________________________________________________________
zero_padding2d_4 (ZeroPaddin (None, 250, 375, 128)     0
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 250, 375, 128)     147584
_________________________________________________________________
batch_normalization_23 (Batc (None, 250, 375, 128)     512
_________________________________________________________________
activation_23 (Activation)   (None, 250, 375, 128)     0
_________________________________________________________________
conv2d_24 (Conv2D)           (None, 250, 375, 64)      73792
_________________________________________________________________
batch_normalization_24 (Batc (None, 250, 375, 64)      256
_________________________________________________________________
activation_24 (Activation)   (None, 250, 375, 64)      0
_________________________________________________________________
up_sampling2d_5 (UpSampling2 (None, 500, 750, 64)      0
_________________________________________________________________
conv2d_25 (Conv2D)           (None, 500, 750, 64)      36928
_________________________________________________________________
batch_normalization_25 (Batc (None, 500, 750, 64)      256
_________________________________________________________________
activation_25 (Activation)   (None, 500, 750, 64)      0
_________________________________________________________________
conv2d_26 (Conv2D)           (None, 500, 750, 12)      780
_________________________________________________________________
batch_normalization_26 (Batc (None, 500, 750, 12)      48
_________________________________________________________________
reshape_1 (Reshape)          (None, 375000, 12)        0
_________________________________________________________________
activation_26 (Activation)   (None, 375000, 12)        0
=================================================================
Total params: 29,459,708
Trainable params: 29,443,812
Non-trainable params: 15,896
_________________________________________________________________
