>>> model.summary()
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            (None, 500, 750, 3)  0
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 500, 750, 64) 1792        input_1[0][0]
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 500, 750, 64) 256         conv2d_1[0][0]
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 500, 750, 64) 0           batch_normalization_1[0][0]
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 500, 750, 64) 36928       activation_1[0][0]
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 500, 750, 64) 256         conv2d_2[0][0]
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 500, 750, 64) 0           batch_normalization_2[0][0]
__________________________________________________________________________________________________
max_pooling_with_argmax2d_1 (Ma [(None, 250, 375, 64 0           activation_2[0][0]
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 250, 375, 128 73856       max_pooling_with_argmax2d_1[0][0]
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 250, 375, 128 512         conv2d_3[0][0]
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 250, 375, 128 0           batch_normalization_3[0][0]
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 250, 375, 128 147584      activation_3[0][0]
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 250, 375, 128 512         conv2d_4[0][0]
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 250, 375, 128 0           batch_normalization_4[0][0]
__________________________________________________________________________________________________
max_pooling_with_argmax2d_2 (Ma [(None, 125, 187, 12 0           activation_4[0][0]
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 125, 187, 256 295168      max_pooling_with_argmax2d_2[0][0]
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 125, 187, 256 1024        conv2d_5[0][0]
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 125, 187, 256 0           batch_normalization_5[0][0]
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 125, 187, 256 590080      activation_5[0][0]
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 125, 187, 256 1024        conv2d_6[0][0]
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 125, 187, 256 0           batch_normalization_6[0][0]
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 125, 187, 256 590080      activation_6[0][0]
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 125, 187, 256 1024        conv2d_7[0][0]
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 125, 187, 256 0           batch_normalization_7[0][0]
__________________________________________________________________________________________________
max_pooling_with_argmax2d_3 (Ma [(None, 62, 93, 256) 0           activation_7[0][0]
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 62, 93, 512)  1180160     max_pooling_with_argmax2d_3[0][0]
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 62, 93, 512)  2048        conv2d_8[0][0]
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 62, 93, 512)  0           batch_normalization_8[0][0]
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 62, 93, 512)  2359808     activation_8[0][0]
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 62, 93, 512)  2048        conv2d_9[0][0]
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 62, 93, 512)  0           batch_normalization_9[0][0]
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 62, 93, 512)  2359808     activation_9[0][0]
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 62, 93, 512)  2048        conv2d_10[0][0]
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 62, 93, 512)  0           batch_normalization_10[0][0]
__________________________________________________________________________________________________
max_pooling_with_argmax2d_4 (Ma [(None, 31, 46, 512) 0           activation_10[0][0]
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 31, 46, 512)  2359808     max_pooling_with_argmax2d_4[0][0]
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 31, 46, 512)  2048        conv2d_11[0][0]
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 31, 46, 512)  0           batch_normalization_11[0][0]
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 31, 46, 512)  2359808     activation_11[0][0]
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 31, 46, 512)  2048        conv2d_12[0][0]
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 31, 46, 512)  0           batch_normalization_12[0][0]
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 31, 46, 512)  2359808     activation_12[0][0]
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 31, 46, 512)  2048        conv2d_13[0][0]
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 31, 46, 512)  0           batch_normalization_13[0][0]
__________________________________________________________________________________________________
max_pooling_with_argmax2d_5 (Ma [(None, 15, 23, 512) 0           activation_13[0][0]
__________________________________________________________________________________________________
max_unpooling2d_1 (MaxUnpooling (None, 30, 46, 512)  0           max_pooling_with_argmax2d_5[0][0]
                                                                 max_pooling_with_argmax2d_5[0][1]
__________________________________________________________________________________________________
zero_padding2d_1 (ZeroPadding2D (None, 31, 46, 512)  0           max_unpooling2d_1[0][0]
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 31, 46, 512)  2359808     zero_padding2d_1[0][0]
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 31, 46, 512)  2048        conv2d_14[0][0]
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 31, 46, 512)  0           batch_normalization_14[0][0]
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 31, 46, 512)  2359808     activation_14[0][0]
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 31, 46, 512)  2048        conv2d_15[0][0]
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 31, 46, 512)  0           batch_normalization_15[0][0]
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 31, 46, 512)  2359808     activation_15[0][0]
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 31, 46, 512)  2048        conv2d_16[0][0]
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 31, 46, 512)  0           batch_normalization_16[0][0]
__________________________________________________________________________________________________
max_unpooling2d_2 (MaxUnpooling (None, 62, 92, 512)  0           activation_16[0][0]
                                                                 max_pooling_with_argmax2d_4[0][1]
__________________________________________________________________________________________________
zero_padding2d_2 (ZeroPadding2D (None, 62, 93, 512)  0           max_unpooling2d_2[0][0]
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 62, 93, 512)  2359808     zero_padding2d_2[0][0]
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 62, 93, 512)  2048        conv2d_17[0][0]
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 62, 93, 512)  0           batch_normalization_17[0][0]
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 62, 93, 512)  2359808     activation_17[0][0]
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 62, 93, 512)  2048        conv2d_18[0][0]
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 62, 93, 512)  0           batch_normalization_18[0][0]
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 62, 93, 256)  1179904     activation_18[0][0]
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 62, 93, 256)  1024        conv2d_19[0][0]
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 62, 93, 256)  0           batch_normalization_19[0][0]
__________________________________________________________________________________________________
max_unpooling2d_3 (MaxUnpooling (None, 124, 186, 256 0           activation_19[0][0]
                                                                 max_pooling_with_argmax2d_3[0][1]
__________________________________________________________________________________________________
zero_padding2d_3 (ZeroPadding2D (None, 125, 187, 256 0           max_unpooling2d_3[0][0]
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 125, 187, 256 590080      zero_padding2d_3[0][0]
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 125, 187, 256 1024        conv2d_20[0][0]
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 125, 187, 256 0           batch_normalization_20[0][0]
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 125, 187, 256 590080      activation_20[0][0]
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 125, 187, 256 1024        conv2d_21[0][0]
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 125, 187, 256 0           batch_normalization_21[0][0]
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 125, 187, 128 295040      activation_21[0][0]
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 125, 187, 128 512         conv2d_22[0][0]
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 125, 187, 128 0           batch_normalization_22[0][0]
__________________________________________________________________________________________________
max_unpooling2d_4 (MaxUnpooling (None, 250, 374, 128 0           activation_22[0][0]
                                                                 max_pooling_with_argmax2d_2[0][1]
__________________________________________________________________________________________________
zero_padding2d_4 (ZeroPadding2D (None, 250, 375, 128 0           max_unpooling2d_4[0][0]
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 250, 375, 128 147584      zero_padding2d_4[0][0]
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 250, 375, 128 512         conv2d_23[0][0]
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 250, 375, 128 0           batch_normalization_23[0][0]
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 250, 375, 64) 73792       activation_23[0][0]
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 250, 375, 64) 256         conv2d_24[0][0]
__________________________________________________________________________________________________
activation_24 (Activation)      (None, 250, 375, 64) 0           batch_normalization_24[0][0]
__________________________________________________________________________________________________
max_unpooling2d_5 (MaxUnpooling (None, 500, 750, 64) 0           activation_24[0][0]
                                                                 max_pooling_with_argmax2d_1[0][1]
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 500, 750, 64) 36928       max_unpooling2d_5[0][0]
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 500, 750, 64) 256         conv2d_25[0][0]
__________________________________________________________________________________________________
activation_25 (Activation)      (None, 500, 750, 64) 0           batch_normalization_25[0][0]
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 500, 750, 12) 780         activation_25[0][0]
__________________________________________________________________________________________________
batch_normalization_26 (BatchNo (None, 500, 750, 12) 48          conv2d_26[0][0]
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 375000, 12)   0           batch_normalization_26[0][0]
__________________________________________________________________________________________________
activation_26 (Activation)      (None, 375000, 12)   0           reshape_1[0][0]
==================================================================================================
Total params: 29,459,708
Trainable params: 29,443,812
Non-trainable params: 15,896
__________________________________________________________________________________________________
